In [1]:
import pandas as pd
patients_df = pd.read_csv("/Users/sri_sai_nikhil_enni/Documents/DMDD/Assignment 3/train.csv")
patients_df.drop(columns = ["Hospital_type_code","City_Code_Hospital","Hospital_region_code","Available Extra Rooms in Hospital"],inplace = True)

In [2]:
patients_df.columns

Index(['case_id', 'Hospital_code', 'Department', 'Ward_Type',
       'Ward_Facility_Code', 'Bed Grade', 'patientid', 'City_Code_Patient',
       'Type of Admission', 'Severity of Illness', 'Visitors with Patient',
       'Age', 'Admission_Deposit', 'Stay'],
      dtype='object')

In [5]:
from tqdm import tqdm

In [7]:
pip install faker

Collecting faker
  Downloading Faker-15.3.4-py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 12.4 MB/s eta 0:00:0000:010:01
Requirement already satisfied: python-dateutil>=2.4 in /Users/sri_sai_nikhil_enni/opt/anaconda3/lib/python3.9/site-packages (from faker) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/sri_sai_nikhil_enni/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Installing collected packages: faker
Successfully installed faker-15.3.4
Note: you may need to restart the kernel to use updated packages.

In [8]:
from faker import Faker
fake = Faker()

names = []
for i in tqdm(range(patients_df['patientid'].nunique())):
    names.append(fake.name().lower())

100%|██████████| 92017/92017 [00:07<00:00, 12190.64it/s]

In [9]:
patients_df['City_Code_Patient'].unique()

array([ 7.,  8.,  2.,  5.,  6.,  3.,  4.,  1.,  9., 14., nan, 25., 15.,
       12., 10., 28., 24., 23., 20., 11., 13., 21., 18., 16., 26., 27.,
       22., 19., 31., 34., 32., 30., 29., 37., 33., 35., 36., 38.])

In [10]:
patients_df1 = pd.DataFrame()
patients_df1['patientid'] = patients_df['patientid'].unique()
patients_df1['name'] = names
patients_df1.head()

   patientid               name
0      31397    lydia blackwell
1      63418     ronald johnson
2       8088  michelle gonzales
3      28843      miguel carter
4     109338   molly villarreal

In [11]:
patients_df2 = pd.merge(patients_df1,patients_df[['patientid','Age']],on = 'patientid')

In [12]:
#2Interval Age to Integer Age
patients_df2['Age'] = patients_df2['Age'].apply(lambda x : sum([int(i.strip()) for i in x.split("-")])*0.5)
patients_df2 = patients_df2.rename(columns = {"Age":"age"})

In [13]:
patients_df2.head()

   patientid             name   age
0      31397  lydia blackwell  55.5
1      31397  lydia blackwell  55.5
2      31397  lydia blackwell  55.5
3      31397  lydia blackwell  55.5
4      31397  lydia blackwell  55.5

In [14]:
patients_df2 = patients_df2.drop_duplicates().reset_index(drop = True)
patients_df2.head()

   patientid               name   age
0      31397    lydia blackwell  55.5
1      63418     ronald johnson  75.5
2       8088  michelle gonzales  35.5
3      28843      miguel carter  45.5
4     109338   molly villarreal  35.5

In [15]:
patients_df2

       patientid               name   age
0          31397    lydia blackwell  55.5
1          63418     ronald johnson  75.5
2           8088  michelle gonzales  35.5
3          28843      miguel carter  45.5
4         109338   molly villarreal  35.5
...          ...                ...   ...
92012      86499    deborah jackson  45.5
92013        325     brenda johnson  85.5
92014     125235         adam moore  75.5
92015      91081   bonnie contreras  15.5
92016      21641           mark lee  15.5

[92017 rows x 3 columns]

In [16]:
patients_df2.to_csv("/Users/sri_sai_nikhil_enni/Documents/DMDD/Assignment 3/patients_data.csv",index = False)